{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "# **Улучшение успеваемости**\n",
        "\n",
        "Ограничение времени 1 секунда\n",
        "Ограничение памяти 64Mb\n",
        "\n",
        "Ввод стандартный ввод или input.txt\n",
        "Вывод стандартный вывод или output.txt\n",
        "\n",
        "В лицее на уроках информатики ответы учеников оцениваются целым числом баллов от 2 до 5 . Итоговая оценка по информатике выставляется как среднее арифметическое оценок на всех уроках, округленное до ближайшего целого числа. Если среднее значение находится ровно посередине между двумя целыми числами, то оценка округляется вверх.\n",
        "\n",
        "\n",
        "Все ученики лицея стремятся получить итоговую оценку по информатике не ниже 4 баллов. К сожалению, один из учеников получил на уроках a двоек, b троек и c четвёрок. Теперь он планирует получить несколько пятёрок, причем хочет, чтобы итоговая оценка была не меньше 4 баллов. Ему надо понять, какое минимальное количество пятёрок ему необходимо получить, чтобы добиться своей цели.\n",
        "\n",
        "Требуется написать программу, которая по заданным целым неотрицательным числам a, b и c определяет минимальное количество пятёрок, которое необходимо получить ученику, чтобы его итоговая оценка по информатике была не меньше 4 баллов.\n",
        "\n",
        "## **Формат ввода**\n",
        "Входные данные содержат три строки. Первая строка содержит целое неотрицательное число a , вторая строка содержит целое неотрицательное число b , третья строка содержит целое неотрицательное число c (0 ≤ a, b, c 10^15, a+b+c ≥  1).\n",
        "\n",
        "## **Формат вывода**\n",
        "\n",
        "Выходные данные должны содержать одно число: минимальное число пятерок, которое необходимо получить ученику, чтобы итоговая оценка была не меньше 4 баллов."
      ],
      "metadata": {
        "id": "-WEI_v9qQaT4"
      }
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "L_jvr-RDteek"
      },
      "outputs": [],
      "source": [
        "import sys\n",
        "import math\n",
        "\n",
        "def main():\n",
        "    two = int(input())\n",
        "    three = int(input())\n",
        "    four = int(input())\n",
        "\n",
        "    sum_score = 2 * two + 3 * three + 4 * four\n",
        "    number_score = two + three + four\n",
        "\n",
        "    numerator = 7 * number_score - 2 * sum_score\n",
        "    if numerator <= 0:\n",
        "        count = 0\n",
        "    else:\n",
        "        count = (numerator + 2) // 3\n",
        "\n",
        "    print(count)\n",
        "\n",
        "if __name__ == '__main__':\n",
        "    main()\n"
      ]
    }
  ]
}