{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "# **Разные цифры**\n",
        "\n",
        "Дан список из n различных чисел ai (1≤ai≤10^9).\n",
        "\n",
        "Выберите три числа такие, что в десятичной записи этих чисел встречаются все цифры от 0 до 9. В выбранных числах некоторые цифры могут встречаться более одного раза.\n",
        "\n",
        "Обратите внимание, что в одном запуске необходимо обработать несколько тестовых наборов.\n",
        "\n",
        "## **Формат ввода**\n",
        "В первой строке записано число t (1≤t≤100) — количество тестовых наборов.\n",
        "\n",
        "Далее следуют описания тестовых наборов. Каждый тестовый набор занимает 2 строки. В первой строке записано число n (3≤n≤30). Во второй строке записаны n чисел ai. Все ai различны.\n",
        "\n",
        "Гарантируется, что для каждого тестового набора решение существует.\n",
        "\n",
        "## **Формат вывода**\n",
        "\n",
        "Для каждого тестового набора выведите три числа x, y и z из множества, в десятичной записи которых встречаются все цифры от 0 до 9.\n",
        "\n",
        "Если решений несколько, выведите любое из них."
      ],
      "metadata": {
        "id": "hw03r3BpRF1b"
      }
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "NRoYiVnD6FVs"
      },
      "outputs": [],
      "source": [
        "import sys\n",
        "\n",
        "\n",
        "def main():\n",
        "    t = int(input())\n",
        "    for _ in range(t):\n",
        "        n = int(input())\n",
        "        a = list(map(int, input().split()))\n",
        "        flag = False\n",
        "        for i in range(n):\n",
        "            for j in range(i + 1, n):\n",
        "                for k in range(j + 1, n):\n",
        "                    s = set(str(a[i]) + str(a[j]) + str(a[k]))\n",
        "                    if len(s) == 10:\n",
        "                        print(a[i], a[j], a[k])\n",
        "                        flag = True\n",
        "                        break\n",
        "                if flag:\n",
        "                    break\n",
        "            if flag:\n",
        "                break\n",
        "if __name__ == '__main__':\n",
        "    main()"
      ]
    }
  ]
}