{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "# **Ещё одна задача на теорию чисел**\n",
        "\n",
        "Ограничение времени 1 секунда\n",
        "Ограничение памяти 64Mb\n",
        "\n",
        "Ввод стандартный ввод или input.txt\n",
        "Вывод стандартный вывод или output.txt\n",
        "\n",
        "Лене очень нравится теория чисел. В прошлый раз она просила участников сезона угадать функцию Эйлера. К сожалению, для некоторых пользователей эта задача оказалась слишком сложной, поэтому Лена придумала задачку попроще.\n",
        "\n",
        "Вам даны 2 натуральных числа\n",
        "a\n",
        "a и\n",
        "b\n",
        "b. Необходимо посчитать НОД(a, b) и НОК(a, b).\n",
        "\n",
        "Напомним, что:\n",
        "НОД(a,b)− наибольшее натуральное число, на которое числа a, b делятся без остатка.\n",
        "\n",
        "НОК(a,b)− наименьшее натуральное число, которое делится на числа a, b без остатка.\n",
        "\n",
        "## **Формат ввода**\n",
        "Единственная входная строка содержит два числа − a,b(1≤a,b≤10^9).\n",
        "\n",
        "## **Формат вывода**\n",
        "\n",
        "Выведите 2 целых числа − НОД(a,b) и НОК(a,b).\n"
      ],
      "metadata": {
        "id": "-WEI_v9qQaT4"
      }
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "L_jvr-RDteek"
      },
      "outputs": [],
      "source": [
        "import sys\n",
        "\n",
        "def main():\n",
        "    a, b = map(int, input().split())\n",
        "    gcd_value = 1\n",
        "    for i in range(1, min(a,b) + 1):\n",
        "        if a % i == 0 and b % i == 0:\n",
        "            gcd_value = i\n",
        "\n",
        "    lcm_value = (a // gcd_value) * b\n",
        "    print(gcd_value, lcm_value)\n",
        "\n",
        "if __name__ == '__main__':\n",
        "    main()"
      ]
    }
  ]
}