{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "# **Выставление тегов**\n",
        "\n",
        "Ограничение времени 1 секунда\n",
        "Ограничение памяти 64Mb\n",
        "\n",
        "Ввод стандартный ввод или input.txt\n",
        "Вывод стандартный вывод или output.txt\n",
        "\n",
        "Большинство задач сезона CodeRun имеют теги, помогающие пользователям выбрать подходящий алгоритм для решения. Известно, что для первой и второй задач каждого трека количество тегов равно 1 (t[1]=t[2]=1), а для всех следующих количество тегов вычисляется по следующему правилу:\n",
        "\n",
        "t[i]=t[i−1]+t[i−2], где t[i] - количество тегов задачи с номером i.\n",
        "\n",
        "Было установлено, что на выставление одного тега требуется одна секунда. Посчитайте, сколько всего времени потребуется для выставления всех тегов.\n",
        "\n",
        "## **Формат ввода**\n",
        "\n",
        "На вход подаётся одно целое число (1≤n≤35) - количество задач в треке.\n",
        "\n",
        "## **Формат вывода**\n",
        "\n",
        "Выведите одно целое число − сумму t[i] − время, необходимое для расстановки тегов для всех задач.\n",
        "\n"
      ],
      "metadata": {
        "id": "-WEI_v9qQaT4"
      }
    },
    {
      "cell_type": "code",
      "execution_count": 1,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "L_jvr-RDteek",
        "outputId": "64302080-ae85-4cab-833f-72c9cbb7d361"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "1 1\n",
            "2\n"
          ]
        }
      ],
      "source": [
        "import sys\n",
        "\n",
        "\n",
        "def main():\n",
        "    n = int(input())\n",
        "    if n == 1:\n",
        "        print(1)\n",
        "    elif n == 2:\n",
        "        print(2)\n",
        "    else:\n",
        "        t = [0] * n\n",
        "        t[0] = t[1] = 1\n",
        "        for i in range(2, n):\n",
        "            t[i] = t[i-1] + t[i-2]\n",
        "        print(sum(t))\n",
        "\n",
        "if __name__ == '__main__':\n",
        "    main()"
      ]
    }
  ]
}