{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "# **Сапёр**\n",
        "\n",
        "Ограничение времени 1 секунда\n",
        "Ограничение памяти 64Mb\n",
        "\n",
        "Ввод стандартный ввод или input.txt\n",
        "Вывод стандартный вывод или output.txt\n",
        "\n",
        "Вам необходимо построить поле для игры «Сапер» по его конфигурации — размерам и координатам расставленных на нём мин.\n",
        "\n",
        "Вкратце напомним правила построения поля для игры «Сапер»:\n",
        "\n",
        "Поле состоит из клеток с минами и пустых клеток\n",
        "\n",
        "Клетки с миной обозначаются символом *****\n",
        "\n",
        "Пустые клетки содержат число kij,0≤kij≤8 — количество мин на соседних клетках. Соседними клетками являются восемь клеток, имеющих смежный угол или сторону.\n",
        "\n",
        "## **Формат ввода**\n",
        "В первой строке содержатся три числа: N,1≤N≤100 - количество строк на поле, M,1≤M≤100 - количество столбцов на поле, K, 0≤K≤N⋅M - количество мин на поле.\n",
        "\n",
        "В следующих K строках содержатся по два числа с координатами мин: p,1≤p≤N - номер строки мины, q,1≤q≤M - номер столбца мины.\n",
        "\n",
        "## **Формат вывода**\n",
        "\n",
        "Выведите построенное поле, разделяя строки поля переводом строки, а столбцы - пробелом."
      ],
      "metadata": {
        "id": "-WEI_v9qQaT4"
      }
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "L_jvr-RDteek"
      },
      "outputs": [],
      "source": [
        "import sys\n",
        "\n",
        "\n",
        "def main():\n",
        "    N, M, K = map(int, input().split())\n",
        "\n",
        "    field = [[0 for _ in range(M)] for _ in range(N)]\n",
        "\n",
        "    mines = [tuple(map(int, input().split())) for _ in range(K)]\n",
        "\n",
        "    directions = [(-1, -1), (-1, 0), (-1, 1),\n",
        "                ( 0, -1),          ( 0, 1),\n",
        "                ( 1, -1), ( 1, 0), ( 1, 1)]\n",
        "\n",
        "    for x, y in mines:\n",
        "        i, j = x - 1, y - 1\n",
        "        field[i][j] = '*'\n",
        "\n",
        "        for di, dj in directions:\n",
        "            ni, nj = i + di, j + dj\n",
        "            if 0 <= ni < N and 0 <= nj < M and field[ni][nj] != '*':\n",
        "                field[ni][nj] += 1\n",
        "\n",
        "    for row in field:\n",
        "        print(*row)\n",
        "\n",
        "\n",
        "\n",
        "if __name__ == '__main__':\n",
        "    main()"
      ]
    }
  ]
}