{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "# **29 задача аналитики**\n",
        "\n",
        "Ограничение времени 1 секунда\n",
        "Ограничение памяти 64Mb\n",
        "\n",
        "Ввод стандартный ввод или input.txt\n",
        "Вывод стандартный вывод или output.txt\n",
        "\n",
        "В трек аналитики второго сезона вошло 28 задач, однако кроме них была подготовлена ещё одна задача. Так как в сезон она не вошла, то предлагаем решить вам её сейчас.\n",
        "\n",
        "Вам дано квадратное уравнение вида:\n",
        "\n",
        "ax^2 + bx + c = 0, где a,b и c — целые числа, такие что a≠0.\n",
        "\n",
        "Напишите программу, которая решает это уравнение.\n",
        "\n",
        "## **Формат ввода**\n",
        "Единственная строка входных данных содержит три целых числа a,b,c(−10^3≤a,b,c≤10^3,a≠0).\n",
        "\n",
        "## **Формат вывода**\n",
        "\n",
        "В первой строке выведите количество действительных корней уравнения.\n",
        "\n",
        "В второй строке выведите сами корни. Если уравнение имеет два корня, то выведите их через пробел в порядке возрастания. Если корень один, то выведите его. Если корней нет, то ничего выводить не нужно. Ваш ответ будет принят, если введенные числа отличаются от правильных ответов на величину не более 10 ** (-6).\n",
        "\n"
      ],
      "metadata": {
        "id": "-WEI_v9qQaT4"
      }
    },
    {
      "cell_type": "code",
      "execution_count": 1,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "L_jvr-RDteek",
        "outputId": "64302080-ae85-4cab-833f-72c9cbb7d361"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "1 1\n",
            "2\n"
          ]
        }
      ],
      "source": [
        "import sys\n",
        "\n",
        "\n",
        "def main():\n",
        "    a, b, c = map(int, input().split())\n",
        "    dscr = b**2 - 4 * a * c\n",
        "    if dscr > 0:\n",
        "        x1 = (-b - dscr ** 0.5) / (2 * a)\n",
        "        x2 = (-b + dscr ** 0.5) / (2 * a)\n",
        "        print(2)\n",
        "        print(*sorted([x1,x2]))\n",
        "    elif dscr == 0:\n",
        "        print(1)\n",
        "        print((-b) / (2*a))\n",
        "    else:\n",
        "        print(0)\n",
        "\n",
        "\n",
        "if __name__ == '__main__':\n",
        "    main()"
      ]
    }
  ]
}