{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "# **Симметричная последовательность**\n",
        "\n",
        "Ограничение времени 1 секунда\n",
        "Ограничение памяти 64Mb\n",
        "\n",
        "Ввод стандартный ввод или input.txt\n",
        "Вывод стандартный вывод или output.txt\n",
        "\n",
        "Последовательность чисел назовём симметричной, если она одинаково читается как слева направо, так и справа налево. Например, следующие последовательности являются симметричными:\n",
        "\n",
        "1 2 3 4 5 4 3 2 1\n",
        "\n",
        "1 2 1 2 2 1 2 1\n",
        "\n",
        "Вашей программе будет дана последовательность чисел. Требуется определить, какое минимальное количество и каких чисел надо приписать в конец этой последовательности, чтобы она стала симметричной.\n",
        "\n",
        "## **Формат ввода**\n",
        "Сначала вводится число N — количество элементов исходной последовательности (1 ≤ N ≤ 100). Далее идут N чисел — элементы этой последовательности, натуральные числа от 1 до 9.\n",
        "\n",
        "## **Формат вывода**\n",
        "\n",
        "Выведите сначала число M — минимальное количество элементов, которое надо дописать к последовательности, а потом M чисел (каждое — от 1 до 9) — числа, которые надо дописать к последовательности.\n"
      ],
      "metadata": {
        "id": "-WEI_v9qQaT4"
      }
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "L_jvr-RDteek"
      },
      "outputs": [],
      "source": [
        "import sys\n",
        "\n",
        "def is_palindrome(sequence):\n",
        "    return sequence == sequence[::-1]\n",
        "\n",
        "def main():\n",
        "    N = int(input())\n",
        "    sequence = list(map(int,input().split()))\n",
        "\n",
        "    for i in range(N):\n",
        "        if is_palindrome(sequence[i:]):\n",
        "            lst = sequence[:i][::-1]\n",
        "            break\n",
        "\n",
        "    print(len(lst))\n",
        "    if lst:\n",
        "        print(*lst)\n",
        "\n",
        "\n",
        "\n",
        "\n",
        "\n",
        "if __name__ == '__main__':\n",
        "    main()"
      ]
    }
  ]
}