{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "# **Туризм**\n",
        "\n",
        "Ограничение времени 1 секунда\n",
        "Ограничение памяти 64Mb\n",
        "\n",
        "Ввод стандартный ввод или input.txt\n",
        "Вывод стандартный вывод или output.txt\n",
        "\n",
        "Горная цепь состоит из отрезков, соединяющих точки на плоскости, каждая из которых находится правее предыдущей (координата x строго возрастает).\n",
        "\n",
        "Трассой на горной цепи называется маршрут по отрезкам цепи из одной точки в другую. Трассы ориентированы — то есть маршрут может быть как слева направо, так и справа налево.\n",
        "\n",
        "Подъёмом на трассе называется такой отрезок, на котором высота (координата y) возрастает, а высотой подъёма — разность высот между начальной и конечной точками отрезка.\n",
        "\n",
        "Вам даны несколько трасс на одной горной цепи. Помогите для каждой трассы определить суммарную высоту подъёмов.\n",
        "\n",
        "\n",
        "\n",
        "## **Формат ввода**\n",
        "В первой строке содержится число N (1≤N≤30000) — количество точек в цепи, задающей горную цепь. Далее в N строках содержатся координаты точек — два целых числа xi и yi ​(1≤xi,yi≤30000, xi≤xi+1).\n",
        "\n",
        "В следующей строке находится число M — количество трасс (1≤M≤30000).\n",
        "\n",
        "Далее в M строках содержатся описания трасс. Каждое описание представляет собой два целых числа, si и fi (1≤si,fi≤N) — номера точек начала и конца трассы. Начало и конец трассы могут совпадать. Точки нумеруются с единицы.\n",
        "\n",
        "## **Формат вывода**\n",
        "\n",
        "Для каждой трассы выведите одно число — суммарную высоту подъемов на данной трассе."
      ],
      "metadata": {
        "id": "-WEI_v9qQaT4"
      }
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "L_jvr-RDteek"
      },
      "outputs": [],
      "source": [
        "import sys\n",
        "\n",
        "\n",
        "def main():\n",
        "    N = int(input())\n",
        "    y = []\n",
        "    for _ in range(N):\n",
        "        x_i, y_i = map(int,input().split())\n",
        "        y.append(y_i)\n",
        "\n",
        "    up_forward = [0] * N\n",
        "    up_backward = [0] * N\n",
        "\n",
        "    for i in range(1, N):\n",
        "        up_forward[i] = up_forward[i-1]\n",
        "        if y[i] > y[i-1]:\n",
        "            up_forward[i] += y[i] - y[i-1]\n",
        "\n",
        "    for i in range(N - 2, -1, -1):\n",
        "        up_backward[i] = up_backward[i+1]\n",
        "        if y[i] > y[i+1]:\n",
        "            up_backward[i] += y[i] - y[i+1]\n",
        "\n",
        "    M = int(input())\n",
        "    for _ in range(M):\n",
        "        i,j = map(int, input().split())\n",
        "        i -= 1\n",
        "        j -= 1\n",
        "        if i < j:\n",
        "            print(up_forward[j] - up_forward[i])\n",
        "        else:\n",
        "            print(up_backward[j] - up_backward[i])\n",
        "\n",
        "if __name__ == '__main__':\n",
        "    main()"
      ]
    }
  ]
}